marian1911/procesamiento_digital_s/Laboratorio_1_PDS/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC6 (number 78), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_Start_Stop_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_Start_Stop_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_Start_Stop_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_Start_Stop_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_Start_Stop_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_Sample_Time_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_Sample_Time_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_Sample_Time_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_Sample_Time_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_Sample_Time_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC0 (number 70), J1[11]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ts_8k_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ts_8k_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ts_8k_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ts_8k_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_ts_8k_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC1 (number 71), J1[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ts_16k_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ts_16k_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ts_16k_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ts_16k_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_ts_16k_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC2 (number 72), J1[14]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ts_22k_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ts_22k_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ts_22k_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ts_22k_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_ts_22k_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC3 (number 73), J1[16]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ts_44k_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ts_44k_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ts_44k_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ts_44k_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_ts_44k_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC4 (number 76), J2[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ts_48k_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ts_48k_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ts_48k_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ts_48k_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_ts_48k_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC6 (number 78), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*! @name PORTB21 (number 67), D12[3]/LEDRGB_BLUE
  @{ */

